In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as pyplot
from country_code_3166 import ISO3166

### Import data

In [2]:
raw = pd.read_csv('./Data_salaries.csv')

### Explore data

In [3]:
raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7974 entries, 0 to 7973
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           7974 non-null   int64
 1   experience_level    7974 non-null   object
 2   employment_type     7974 non-null   object
 3   job_title           7974 non-null   object
 4   salary              7974 non-null   int64
 5   salary_currency     7974 non-null   object
 6   salary_in_usd       7974 non-null   int64
 7   employee_residence  7974 non-null   object
 8   remote_ratio        7974 non-null   int64
 9   company_location    7974 non-null   object
 10  company_size        7974 non-null   object
dtypes: int64(4), object(7)
memory usage: 685.4+ KB

In [4]:
raw.shape

(7974, 11)

In [5]:
raw.head(2)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Business Intelligence Engineer,202800,USD,202800,US,0,US,L
1,2023,SE,FT,Business Intelligence Engineer,104300,USD,104300,US,0,US,L

In [6]:
print('Salary in USD:')
print(' Mean: {mean}'.format(mean=raw['salary_in_usd'].mean()))
print(' Min : {min}'.format(min=raw['salary_in_usd'].min()))
print(' Max : {max}'.format(max=raw['salary_in_usd'].max()))

Salary in USD:
 Mean: 149369.3112616002
 Min : 15000
 Max : 450000

### Data Cleaning

### Replace columns and Data wragling

#### Replace Experience level

In [7]:
# raw['experience_level'].unique()
exp_lvl = {
    'EN':'Entry-level / Junior',
    'MI':'Mid-level /Intermediate',
    'SE':'Senior-level/ Expert',
    'EX':'Executive-level / Director'
}
raw['experience_level'].replace(exp_lvl,inplace=True)
# raw.head(2)

#### Replace Employement type

In [8]:
# raw['employment_type'].unique()
emp_lvl = {
    'PT': 'Part-time', 
    'FT': 'Full-time', 
    'CT': 'Contract', 
    'FL': 'Freelance'
}
raw['employment_type'].replace(emp_lvl,inplace=True)
# raw.head(2)

#### Replace employee residence & company location

In [9]:
raw['employee_residence'].replace(ISO3166, inplace=True)
raw['company_location'].replace(ISO3166, inplace=True)
# raw.head(2)

#### Replace Company size

In [10]:
# raw['company_size'].unique()
raw["company_size"].replace({'L':'Large','M':'Medium','S':'Small'},inplace=True)
# raw.head(5)

#### Replace Remote Ratio

In [11]:
raw['remote_ratio'].replace({0:'Not at all',50:'Somthimes',100:'Totally Remote'},inplace=True)

### Sort by salary

In [12]:
raw.sort_values(by=['salary_in_usd'], ascending=False,inplace=True)

In [13]:
raw.head(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
7756,2020,Mid-level /Intermediate,Full-time,Research Scientist,450000,USD,450000,United States of America,Not at all,United States of America,Medium
6268,2022,Mid-level /Intermediate,Full-time,Data Analyst,350000,GBP,430967,United Kingdom (Great Britain),Not at all,United Kingdom (Great Britain),Medium
4268,2023,Mid-level /Intermediate,Full-time,Analytics Engineer,350000,GBP,430640,United Kingdom (Great Britain),Not at all,United Kingdom (Great Britain),Medium
7966,2021,Mid-level /Intermediate,Full-time,Applied Machine Learning Scientist,423000,USD,423000,United States of America,Somthimes,United States of America,Large
4796,2023,Senior-level/ Expert,Full-time,AI Scientist,1500000,ILS,417937,Israel,Not at all,Israel,Large

### Save the output

In [14]:
# raw.to_excel('Data_salaries_output.xlxs',sheet_name="salaries")
# # 
# with pd.ExcelWriter('Data_salaries_output.xlxs',engine='xlsxwriter') as excel_writer:
#     raw.to_excel(excel_writer, sheet_name='salaries', index=False)
raw.to_csv('Data_salaries_output.csv')